In [5]:
#Import
import pandas as pd
import numpy as np
from pydataset import data
np.random.seed(123)

## Exercise 1

In [ ]:
# 1 Run python -m pip install pymysql from your terminal to install the mysql client (any folder is fine)

In [17]:
# Create a function named get_db_url. It should accept a username, hostname, password, and database name 
#  and return a url connection string 
# formatted like in the example at the start of this lesson.
#from env import host, user, password
def get_db_url():
    from env import host, user, password
    url = f'mysql+pymysql://{user}:{password}@{host}/employees'
    return url

In [18]:
url

'mysql+pymysql://mirzakhani_1938:EwmNeGjTFsLMkDOL1yAZCgBJzjVoWhQC@data.codeup.com/employees'

In [19]:
## 3 Use your function to obtain a connection to the employees database.

pd.read_sql('SELECT * FROM employees LIMIT 5 OFFSET 50', url)

   emp_no  birth_date first_name  last_name gender   hire_date
0   10051  1953-07-28   Hidefumi      Caine      M  1992-10-15
1   10052  1961-02-26     Heping     Nitsch      M  1988-05-21
2   10053  1954-09-13     Sanjiv   Zschoche      F  1986-02-04
3   10054  1957-04-04     Mayumi  Schueller      M  1995-03-13
4   10055  1956-06-06     Georgy     Dredge      M  1992-04-27

In [20]:
sql = '''
SELECT
    *
FROM employees
'''
employees_df = pd.read_sql(sql, url)
employees_df.head()

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

In [22]:
#7 How many rows and columns do you have in each DataFrame? Is that what you expected?
employees_df.shape

(300024, 6)

In [23]:
sql = '''
SELECT
    *
FROM titles
'''
titles_df = pd.read_sql(sql, url)
titles_df.head()

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01
3   10004         Engineer  1986-12-01  1995-12-01
4   10004  Senior Engineer  1995-12-01  9999-01-01

In [24]:
titles_df.shape

(443308, 4)

In [25]:
# 8 Display the summary statistics for each DataFrame.
print(titles_df.describe)

<bound method NDFrame.describe of         emp_no            title   from_date     to_date
0        10001  Senior Engineer  1986-06-26  9999-01-01
1        10002            Staff  1996-08-03  9999-01-01
2        10003  Senior Engineer  1995-12-03  9999-01-01
3        10004         Engineer  1986-12-01  1995-12-01
4        10004  Senior Engineer  1995-12-01  9999-01-01
...        ...              ...         ...         ...
443303  499997         Engineer  1987-08-30  1992-08-29
443304  499997  Senior Engineer  1992-08-29  9999-01-01
443305  499998     Senior Staff  1998-12-27  9999-01-01
443306  499998            Staff  1993-12-27  1998-12-27
443307  499999         Engineer  1997-11-30  9999-01-01

[443308 rows x 4 columns]>

In [26]:
# 9 How many unique titles are in the titles DataFrame?
titles_df.title.unique()

array(['Senior Engineer', 'Staff', 'Engineer', 'Senior Staff',
       'Assistant Engineer', 'Technique Leader', 'Manager'], dtype=object)

In [27]:
#10 What is the oldest date in the to_date column?
#titles_df.sort_values(by='to_date' == )
titles_df[titles_df.to_date == titles_df.to_date.min()]

       emp_no     title   from_date     to_date
16064   20869  Engineer  1985-02-17  1985-03-01

In [28]:
#11 What is the most recent date in the to_date column?
#titles_df[titles_df.to_date == titles_df.to_date.max()]
titles_df.sort_values(by=['to_date'], ascending = False)

        emp_no               title   from_date     to_date
0        10001     Senior Engineer  1986-06-26  9999-01-01
251516  270060  Assistant Engineer  1997-12-24  9999-01-01
251529  270070        Senior Staff  1994-12-30  9999-01-01
251528  270069     Senior Engineer  2001-03-31  9999-01-01
251526  270068            Engineer  1999-04-09  9999-01-01
...        ...                 ...         ...         ...
277603  287732               Staff  1985-04-14  1985-04-17
35527    34059     Senior Engineer  1985-02-10  1985-03-23
346216  434232               Staff  1985-02-26  1985-03-20
406358  474918            Engineer  1985-02-10  1985-03-11
16064    20869            Engineer  1985-02-17  1985-03-01

[443308 rows x 4 columns]

## Exercises II

In [31]:
#Copy the users and roles DataFrames from the examples above.
# 1 Create the users DataFrame.

users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})
users

   id   name  role_id
0   1    bob      1.0
1   2    joe      2.0
2   3  sally      3.0
3   4   adam      3.0
4   5   jane      NaN
5   6   mike      NaN

In [32]:
# Create the roles DataFrame

roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})
roles

   id       name
0   1      admin
1   2     author
2   3   reviewer
3   4  commenter

In [33]:
# 2 What is the result of using a right join on the DataFrames?
# Perform an outer join specifying the left and right DataFrame keys.

users.merge(roles, left_on='role_id', right_on='id', how='right', indicator=True)

   id_x name_x  role_id  id_y     name_y      _merge
0   1.0    bob      1.0     1      admin        both
1   2.0    joe      2.0     2     author        both
2   3.0  sally      3.0     3   reviewer        both
3   4.0   adam      3.0     3   reviewer        both
4   NaN    NaN      NaN     4  commenter  right_only

In [34]:
# 3 What is the result of using an outer join on the DataFrames?
users.merge(roles, left_on='role_id', right_on='id', how='outer', indicator=True)

   id_x name_x  role_id  id_y     name_y      _merge
0   1.0    bob      1.0   1.0      admin        both
1   2.0    joe      2.0   2.0     author        both
2   3.0  sally      3.0   3.0   reviewer        both
3   4.0   adam      3.0   3.0   reviewer        both
4   5.0   jane      NaN   NaN        NaN   left_only
5   6.0   mike      NaN   NaN        NaN   left_only
6   NaN    NaN      NaN   4.0  commenter  right_only

In [38]:
# 4 What happens if you drop the foreign keys from the DataFrames and try to merge them?
(users.merge(roles, 
            left_on='role_id', 
            right_on='id', 
            how='outer',
            indicator= True)
    .drop(columns='role_id')
    .rename(columns={'id_x': 'id', 
                     'name_x': 'employee',
                     'id_y': 'role_id',
                     'name_y': 'role'}
            )
)

    id employee  role_id       role      _merge
0  1.0      bob      1.0      admin        both
1  2.0      joe      2.0     author        both
2  3.0    sally      3.0   reviewer        both
3  4.0     adam      3.0   reviewer        both
4  5.0     jane      NaN        NaN   left_only
5  6.0     mike      NaN        NaN   left_only
6  NaN      NaN      4.0  commenter  right_only

In [39]:
# 5 Load the mpg dataset from PyDataset.
mpg = data('mpg') # load the dataset and store it in a variable

In [40]:
# 6 Output and read the documentation for the mpg dataset.
data('mpg', show_doc=True) # view the documentation for the dataset

mpg

PyDataset Documentation (adopted from R Documentation. The displayed examples are in R)

## Fuel economy data from 1999 and 2008 for 38 popular models of car

### Description

This dataset contains a subset of the fuel economy data that the EPA makes
available on http://fueleconomy.gov. It contains only models which had a new
release every year between 1999 and 2008 - this was used as a proxy for the
popularity of the car.

### Usage

    data(mpg)

### Format

A data frame with 234 rows and 11 variables

### Details

  * manufacturer.

  * model.

  * displ. engine displacement, in litres

  * year.

  * cyl. number of cylinders

  * trans. type of transmission

  * drv. f = front-wheel drive, r = rear wheel drive, 4 = 4wd

  * cty. city miles per gallon

  * hwy. highway miles per gallon

  * fl.

  * class.

In [42]:
# 7 How many rows and columns are in the dataset?
mpg.shape

(234, 11)

In [48]:
# 8 Check out your column names and perform any cleanup you may want on them.
mpg.rename(columns={'cty': 'city'}, inplace = True)
mpg.rename(columns={'hwy': 'highway'}, inplace = True)
mpg.rename(columns={'cyl': 'cylinder'}, inplace = True)
mpg.rename(columns={'trans': 'transmission'}, inplace = True)
mpg.rename(columns={'displ': 'displacement'}, inplace = True)
mpg.rename(columns={'drv': 'drive'}, inplace = True)

In [50]:
# 9 Display the summary statistics for the dataset.
print(mpg.describe())

       displacement         year    cylinder        city     highway
count    234.000000   234.000000  234.000000  234.000000  234.000000
mean       3.471795  2003.500000    5.888889   16.858974   23.440171
std        1.291959     4.509646    1.611534    4.255946    5.954643
min        1.600000  1999.000000    4.000000    9.000000   12.000000
25%        2.400000  1999.000000    4.000000   14.000000   18.000000
50%        3.300000  2003.500000    6.000000   17.000000   24.000000
75%        4.600000  2008.000000    8.000000   19.000000   27.000000
max        7.000000  2008.000000    8.000000   35.000000   44.000000

In [61]:
# 10 How many different manufacturers are there?
#mpg_makes = mpg["manufacturer"].unique()
make_unique = mpg['manufacturer'].nunique() 
make_unique

15

In [63]:
# 11 How many different models are there?
model_unique = mpg['model'].nunique() 
model_unique

38

In [65]:
# 12 Create a column named mileage_difference like you did in the DataFrames exercises; 
# this column should contain the difference between highway and city mileage for each car.

mpg = mpg.assign(mileage_difference = (mpg['highway']-mpg['city'])) 
mpg

,manufacturer,model,displacement,year,cylinder,transmission,drive,city,highway,fl,class,mileage_difference
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10
...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,9
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,8
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,10
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,8
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,9

In [66]:
# 13 Create a column named average_mileage like you did in the DataFrames exercises; this is the 
# mean of the city and highway mileage.
# Create a column named average_mileage that is the mean of the city and highway mileage.
mpg["average_mileage"] = (mpg.highway + mpg.city) /2
mpg

,manufacturer,model,displacement,year,cylinder,transmission,drive,city,highway,fl,class,mileage_difference,average_mileage
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,23.5
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,25.0
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,25.5
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,25.5
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,21.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,9,23.5
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,8,25.0
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,10,21.0
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,8,22.0
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,9,21.5

In [85]:
# 14 Create a new column on the mpg dataset named is_automatic that holds boolean values denoting 
# whether the car has an automatic transmission.
mpg["is_automatic"] = mpg["transmission"].str.contains("auto")
mpg

,manufacturer,model,displacement,year,cylinder,transmission,drive,city,highway,fl,class,mileage_difference,average_mileage,is_automatic
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,23.5,True
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,25.0,False
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,25.5,False
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,25.5,True
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,21.0,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,9,23.5,True
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,8,25.0,False
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,10,21.0,True
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,8,22.0,False
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,9,21.5,True

In [107]:
# 15 Using the mpg dataset, find out which which manufacturer has the best miles per gallon on average?
mpg.groupby("manufacturer").average_mileage.mean().nlargest()
# Honda

manufacturer
honda         28.500000
volkswagen    25.074074
hyundai       22.750000
subaru        22.428571
audi          22.027778
Name: average_mileage, dtype: float64

In [112]:
#16 Do automatic or manual cars have better miles per gallon?
# Choose only two columns for my subset.

mpg.groupby("is_automatic").average_mileage.mean()

is_automatic
False    22.227273
True     19.130573
Name: average_mileage, dtype: float64